; domain
(define (domain signs)
    
    (:requirements :typing :action-costs)

    (:types buffer workplace board shape color)

    (:predicates
        (expert-mode)
        (advanced-mode)

        (in-hand-board ?board - board )
        (in-hand-saw)
        (in-hand-paint)
        (hand-free)
	    
        (at ?x - board ?y - buffer)
        (mounted ?x - board ?y - workplace)
        (empty ?x - workplace)
        
        (cuted ?x - board )
        (has-shape ?x - board ?y - shape)

        (painted ?x - board )
        (has-color ?x - board ?y - color)
    )

    (:functions
        (total-cost)
    )

    (:action pick
        :parameters ( ?board - board ?place - buffer)
        :precondition (and (hand-free) (at ?board ?place))
        :effect (and
            (in-hand-board ?board)
            (not (hand-free))
            (not (at ?board ?place)) ) )

    (:action grasp-saw
        :parameters ()
        :precondition (and (hand-free))
        :effect (and
            (in-hand-saw)
            (not (hand-free))
            (increase (total-cost) 1) ) )

    (:action grasp-paint
        :parameters ()
        :precondition (and (hand-free))
        :effect (and
            (in-hand-paint)
            (not (hand-free))
            (increase (total-cost) 1) ) )

    (:action stash
        :parameters ( ?board - board ?place - buffer)
        :precondition (and (in-hand-board ?board))
        :effect (and
            (not (in-hand-board ?board))
            (hand-free)
            (at ?board ?place) ) )

     (:action do-saw
        :parameters ( ?board - board ?place - workplace ?shape - shape)
        :precondition (and
            (in-hand-saw)
            (mounted ?board ?place)
            (not (cuted ?board)))
        :effect (and
            (cuted ?board)
            (has-shape ?board ?shape)
            (increase (total-cost) 8)) )

     (:action do-paint
        :parameters ( ?board - board ?place - workplace ?color - color)
        :precondition (and
            (in-hand-paint)
            (mounted ?board ?place)
            (cuted ?board)
            (not (painted ?board)))
        :effect (and
            (painted ?board)
            (has-color ?board ?color)
            (increase (total-cost) 12)) )


    (:action drop-saw
        :parameters ()
        :precondition (and (in-hand-saw))
        :effect (and
            (not (in-hand-saw))
            (hand-free)
            (increase (total-cost) 1) ) )

    (:action drop-paint
        :parameters ()
        :precondition (and (in-hand-paint))
        :effect (and
            (not (in-hand-paint))
            (hand-free)
            (increase (total-cost) 1) ) )

    (:action mount
        :parameters ( ?board - board ?place - workplace)
        :precondition (and (in-hand-board ?board) (empty ?place) )
        :effect (and
            (not (in-hand-board ?board))
            (hand-free)
            (mounted ?board ?place)
            (not (empty ?place))
            (increase (total-cost) 4) ) )

    (:action umount
        :parameters ( ?board - board ?place - workplace)
        :precondition (and (hand-free) (mounted ?board ?place) )
        :effect (and
            (in-hand-board ?board)
            (not (hand-free))
            (not (mounted ?board ?place))
            (empty ?place)
            (increase (total-cost) 4) ) )

    (:action switch-advanced
        :parameters ()
        :precondition (and (not (advanced-mode)) (not (expert-mode)))
        :effect (and
            (advanced-mode)
            (increase (total-cost) 15)
        )
    )

    (:action switch-expert
        :parameters ()
        :precondition (and (advanced-mode) (not (expert-mode)))
        :effect (and
            (not (advanced-mode))
            (expert-mode)
            (increase (total-cost) 22)
        )
    )

)

; problem
(define (problem big-problem1)
    (:domain signs)
    (:objects
        buff - buffer
        place1 place2 - workplace
        trigon circle square - shape
        blue yellow red green - color
        board0 board1 - board
    )
    (:init
        (empty place1)
        (empty place2)
        (hand-free)
        (= (total-cost) 0)

        (at board0 buff)
        (at board1 buff)
    )
    (:goal
        (and
            (at board0 buff)
            (at board1 buff)

            (has-color board0 yellow)
            (has-color board1 yellow)

            (has-shape board0 trigon)
            (has-shape board1 circle)
        )
    )
    (:metric minimize (total-cost))
)

; plan
1. (pick board1 buff)
   deleted: (hand-free) (at board1 buff)
   added: (in-hand-board board1)
   goals met: 1 of 6
2. (mount board1 place2)
   deleted: (in-hand-board board1) (empty place2)
   added: (hand-free) (mounted board1 place2)
   goals met: 1 of 6
3. (pick board0 buff)
   deleted: (hand-free) (at board0 buff)
   added: (in-hand-board board0)
   goals met: 0 of 6
4. (mount board0 place1)
   deleted: (in-hand-board board0) (empty place1)
   added: (hand-free) (mounted board0 place1)
   goals met: 0 of 6
5. (grasp-saw)
   deleted: (hand-free)
   added: (in-hand-saw)
   goals met: 0 of 6
6. (do-saw board0 place1 trigon)
   added: (cuted board0) (has-shape board0 trigon)
   goals met: 1 of 6
7. (do-saw board1 place2 circle)
   added: (cuted board1) (has-shape board1 circle)
   goals met: 2 of 6
8. (drop-saw)
   deleted: (in-hand-saw)
   added: (hand-free)
   goals met: 2 of 6
9. (grasp-paint)
   deleted: (hand-free)
   added: (in-hand-paint)
   goals met: 2 of 6
10. (do-paint board1 place2 yellow)
   added: (painted board1) (has-color board1 yellow)
   goals met: 3 of 6
11. (do-paint board0 place1 yellow)
   added: (painted board0) (has-color board0 yellow)
   goals met: 4 of 6
12. (drop-paint)
   deleted: (in-hand-paint)
   added: (hand-free)
   goals met: 4 of 6
13. (umount board1 place2)
   deleted: (hand-free) (mounted board1 place2)
   added: (in-hand-board board1) (empty place2)
   goals met: 4 of 6
14. (stash board1 buff)
   deleted: (in-hand-board board1)
   added: (hand-free) (at board1 buff)
   goals met: 5 of 6
15. (umount board0 place1)
   deleted: (hand-free) (mounted board0 place1)
   added: (in-hand-board board0) (empty place1)
   goals met: 5 of 6
16. (stash board0 buff)
   deleted: (in-hand-board board0)
   added: (hand-free) (at board0 buff)
   goals met: 6 of 6
